app/serializers/car_serializer.rb

  def photos
    object.photos.map { |photo| photo.image }
---
SELECT "photos".* FROM "photos" WHERE "photos"."car_id" = ?  [["car_id", 1]]