app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
    def index
    cars = Car.includes(:photos).all

INSERT INTO "cars" ("make", "model", "year", "profile_image", "availability", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      car = Car.new(car_params)
      if car.save