app/controllers/photos_controller.rb

INSERT INTO "photos" ("car_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def create
        photo = Photo.new(photo_params)
        if photo.save